# Задание 1
# Есть словарь: d = {‘a’:3, ‘b’:0, ‘c’:4, ‘d’:-3}. Найти самое большое число из значений словар
# d = {"a": 3, "b": 0, "c": 4, "d": -3}
#
# max = 0
#
# for key, vel in d.items():
#     if max < vel:
#         max = vel
# print(max)

# Задание 2
# Аналогично заданию 1, только словарь d = {‘a’:3, ‘b’: ‘hello’, ‘c’:4, ‘d’:-3}
# d = {"a":3, "b": "hello", "c":4, "d":-3}
# max = 0
# for key, value in d.items():
#     if type(value) == int:
#         if max < value:
#             max = value
# print(max)










