# Есть 2 множества A = {3, 5, 11, 7, 4 -3}, B = {11, 5, 8, 1, 10, 7}
A = {3, 5, 11, 7, 4 -3}
B = {11, 5, 8, 1, 10, 7}
# Задание 1
# Вывести в консоль элементы A, которых нет в B.
# print(A.difference(B))
# Задание 2
# Вывести в консоль общие элементы А и В
# print(A.intersection(B))
# Задание 3
# Вывести в консоль объединение множеств А и В
# print(A.union(B))
# Задание 4
# Есть строка a = “a14b6fh”, как узнать, что все символы уникальны, используя множества и списки?
a = "a14b6fh"
m = set(a)
print(m)